tap "aws/tap"
tap "cloudflare/cloudflare"
tap "dbcli/tap"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "imthaghost/goclone"
tap "macmade/tap"
tap "nektos/tap"
tap "pyroscope-io/brew"
tap "samuelmeuli/tap"
tap "stripe/stripe-cli"
tap "thought-machine/please"
brew "jpeg"
brew "libtiff"
brew "webp"
brew "sqlite"
brew "asciinema"
brew "gettext"
brew "python@3.9"
brew "python@3.8"
brew "awscli"
brew "bat"
brew "bfg"
brew "biber"
brew "caddy"
brew "pkg-config"
brew "cairo"
brew "cloc"
brew "coreutils"
brew "cowsay"
brew "croc"
brew "openldap"
brew "curl"
brew "libtool"
brew "ffmpeg"
brew "findutils"
brew "fonttools"
brew "fzf"
brew "gawk"
brew "geckodriver"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "pinentry"
brew "gnupg"
brew "gnupg@2.2"
brew "golang-migrate"
brew "pango"
brew "graphviz"
brew "gtk+3"
brew "hadolint"
brew "hey"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "latexindent"
brew "libmagic"
brew "libpq"
brew "libyubikey"
brew "little-cms"
brew "lorem"
brew "make"
brew "mariadb"
brew "meilisearch"
brew "micro"
brew "mkcert"
brew "mpv", link: false
brew "nginx", restart_service: true
brew "node"
brew "node@12"
brew "node@14"
brew "node@16"
brew "nss"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "pgcli"
brew "pinentry-mac"
brew "pngquant"
brew "podman"
brew "poetry"
brew "postgresql", restart_service: true
brew "postgresql@13"
brew "py3cairo"
brew "pyenv"
brew "pygobject3"
brew "redis", restart_service: true, link: false
brew "ripgrep"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "siege"
brew "telnet"
brew "texlive"
brew "tflint"
brew "tfsec"
brew "tldr"
brew "tokei"
brew "topgrade"
brew "tree"
brew "unzip"
brew "vegeta"
brew "vips"
brew "watchman"
brew "wget"
brew "xxh"
brew "ykman"
brew "zlib"
brew "zoxide"
brew "golangci/tap/golangci-lint"
brew "hashicorp/tap/terraform"
brew "imthaghost/goclone/goclone"
brew "macmade/tap/trash", args: ["HEAD"]
brew "pyroscope-io/brew/pyroscope"
brew "samuelmeuli/tap/tmignore"
brew "stripe/stripe-cli/stripe"
cask "adoptopenjdk"
cask "appcleaner"
cask "arduino"
cask "blender"
cask "calibre"
cask "cf-terraforming"
cask "chromedriver"
cask "cyberduck"
cask "dbeaver-community"
cask "devtoys"
cask "dozer"
cask "figma"
cask "font-jetbrains-mono"
cask "fontforge"
cask "fritzing"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "integrity"
cask "kap"
cask "keepassxc"
cask "keka"
cask "latest"
cask "meetingbar"
cask "monitorcontrol"
cask "mpv"
cask "mqtt-explorer"
cask "namechanger"
cask "ngrok"
cask "obs"
cask "optimage"
cask "redisinsight"
cask "shifty"
cask "transmission"
cask "vlc"
cask "xquartz"
