tap "ankitpokhrel/jira-cli"
tap "aws/tap"
tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "cooklang/tap"
tap "dbcli/tap"
tap "gabrie30/utils"
tap "golangci/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "imthaghost/goclone"
tap "jandedobbeleer/oh-my-posh"
tap "macmade/tap"
tap "noahgorstein/tap"
tap "redis-stack/redis-stack"
tap "samuelmeuli/tap"
tap "stripe/stripe-cli"
tap "tg44/heptapod"
tap "thought-machine/please"
tap "timescale/tap"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Record and share terminal sessions
brew "asciinema"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Improved shell history for zsh and bash
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Backend processor for BibLaTeX
brew "biber"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Generic library support script
brew "libtool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line tool for the fn project
brew "fn"
# Library for manipulating fonts
brew "fonttools"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Database migrations CLI tool
brew "golang-migrate"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Post-modern modal text editor
brew "helix"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# JSON output from a shell
brew "jo"
# Image manipulation library
brew "jpeg", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Add indentation to LaTeX files
brew "latexindent"
# Pager program similar to more
brew "less"
# Implementation of the file(1) command
brew "libmagic"
# Postgres C API library
brew "libpq"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# Version 1 of the Little CMS library
brew "little-cms"
# Python generator for the console
brew "lorem"
# Utility for directing compilation
brew "make"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@16"
# Libraries for security-enabled client and server applications
brew "nss"
# OCaml package manager
brew "opam"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Modern Python package manager with PEP 582 support
brew "pdm"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PNG image optimizing utility
brew "pngquant"
# Tool for managing OCI containers and pods
brew "podman"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@15", restart_service: true, link: true
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup-init"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# HTTP regression testing and benchmarking utility
brew "siege"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Extraction utility for .zip compressed archives
brew "unzip"
# HTTP load testing tool and library
brew "vegeta"
# Image processing library
brew "vips"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# A tool for glamorous shell scripts
brew "charmbracelet/tap/gum"
# Quickly clone an entire org/users repositories into one directory
brew "gabrie30/utils/ghorg"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Terraform
brew "hashicorp/tap/terraform"
# Website Cloner - Utilizes powerful go routines to clone websites to your computer within seconds.
brew "imthaghost/goclone/goclone"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# This is a command line application to manage and fine-tune Time Machine exclude paths.
brew "tg44/heptapod/heptapod"
# Professional desktop publishing software
cask "affinity-publisher"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# GraphQL client
cask "altair-graphql-client"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# 3D creation suite
cask "blender"
# E-books management software
cask "calibre"
# cf-terraforming is a command line utility to facilitate terraforming your existing Cloudflare resources
cask "cf-terraforming"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# App to build and share containerized applications and microservices
cask "docker"
# Podcast client
cask "doughnut"
# Collaborative team software
cask "figma"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# GIT client
cask "fork"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Tool to scan a website checking for broken links
cask "integrity"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Utility that shows the latest app updates
cask "latest"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
cask "mqtt-explorer"
# Rename a list of files quickly
cask "namechanger"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Image optimization tool
cask "optimage"
# Utility to take screenshots of webpages
cask "paparazzi"
# Colour picker for colours onscreen
cask "pika"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Collaboration platform for API development
cask "postman"
# Environment for statistical computing and graphics
cask "r"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Redis server with additional database capabilities and the visualisation tool RedisInsight.
cask "redis-stack"
# A graphical tool for visualizing data and managing Redis databases
cask "redis-stack-redisinsight"
# Redis Stack Server install a Redis server with additional database capabilities
cask "redis-stack-server"
# Menu bar app that provides more control over Night Shift
cask "shifty"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Messaging app with a focus on speed and security
cask "telegram"
# Menu bar pomodoro timer
cask "tomatobar"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Open-source version of the X.Org X Window System
cask "xquartz"
