tap "ankitpokhrel/jira-cli"
tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "cooklang/tap"
tap "dbcli/tap"
tap "ejoffe/tap"
tap "gabrie30/utils"
tap "golangci/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/services"
tap "imthaghost/goclone"
tap "jandedobbeleer/oh-my-posh"
tap "jdxcode/tap"
tap "macmade/tap"
tap "noahgorstein/tap"
tap "pyroscope-io/brew"
tap "redis-stack/redis-stack"
tap "samuelmeuli/tap"
tap "stripe/stripe-cli"
tap "terrastruct/d2"
tap "tg44/heptapod"
tap "thought-machine/please"
tap "timescale/tap"
brew "act"
brew "actionlint"
brew "libpng"
brew "libtiff"
brew "webp"
brew "argo"
brew "gettext"
brew "atuin"
brew "bat"
brew "icu4c"
brew "bitwarden-cli"
brew "caddy"
brew "freetype"
brew "cairo"
brew "gmp"
brew "coreutils"
brew "openldap"
brew "curl"
brew "d2"
brew "duckdb"
brew "libtool"
brew "elixir"
brew "eza"
brew "libsodium"
brew "fd"
brew "pango"
brew "ffmpeg"
brew "openssl@1.1"
brew "findutils"
brew "fonttools"
brew "fzf"
brew "gawk"
brew "gd"
brew "gh"
brew "git"
brew "git-absorb"
brew "python@3.11"
brew "git-filter-repo"
brew "git-lfs"
brew "gleam"
brew "gnu-sed"
brew "gnu-tar"
brew "pinentry"
brew "gnupg"
brew "golang-migrate"
brew "gtk+3"
brew "hadolint"
brew "pkg-config"
brew "helix"
brew "helm"
brew "httpie"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jc"
brew "jo"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "less"
brew "libmagic"
brew "libpq"
brew "libressl"
brew "libxml2"
brew "libyubikey"
brew "make"
brew "mariadb"
brew "mise"
brew "nss"
brew "ollama"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "pdfcpu"
brew "pdm"
brew "pinentry-mac"
brew "pngquant"
brew "podman"
brew "poetry"
brew "pop"
brew "postgresql@16", restart_service: true
brew "redis", restart_service: true
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "scc"
brew "sccache"
brew "semgrep"
brew "shellcheck"
brew "shfmt"
brew "tealdeer"
brew "telnet"
brew "tflint"
brew "tfsec"
brew "tokei"
brew "topgrade"
brew "typos-cli"
brew "unzip"
brew "uv"
brew "vhs"
brew "vips"
brew "watchman"
brew "wget"
brew "ykman"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "charmbracelet/tap/gum"
brew "golangci/tap/golangci-lint"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "stripe/stripe-cli/stripe"
cask "affinity-publisher"
cask "alacritty"
cask "aldente"
cask "appcleaner"
cask "calibre"
cask "cyberduck"
cask "dbeaver-community"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "integrity"
cask "kap"
cask "keka"
cask "kitty"
cask "latest"
cask "libreoffice"
cask "meetingbar"
cask "namechanger"
cask "optimage"
cask "orbstack"
cask "podman-desktop"
cask "rectangle"
cask "redis-stack-redisinsight"
cask "shifty"
cask "telegram"
cask "xcodes"
cask "xquartz"
vscode "alextreichler.hurl"
vscode "antfu.unocss"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "biomejs.biome"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "casualjim.gotemplate"
vscode "charliermarsh.ruff"
vscode "coolbear.systemd-unit-file"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dorzey.vscode-sqlfluff"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-front-matter"
vscode "elixir-tools.elixir-tools"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "griimick.vhs"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "iliazeus.vscode-ansi"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "kortina.vscode-markdown-notes"
vscode "matthewpi.caddyfile-support"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "ocamllabs.ocaml-platform"
vscode "octref.vetur"
vscode "ohanedan.lowlight-go-errors"
vscode "oven.bun-vscode"
vscode "phoenixframework.phoenix"
vscode "prisma.prisma"
vscode "prql-lang.prql-vscode"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sswg.swift-lang"
vscode "styled-components.vscode-styled-components"
vscode "subpixelgames.generate-sequence"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "terrastruct.d2"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "twixes.pypi-assistant"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-swiftformat"
vscode "wakatime.vscode-wakatime"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "xshrim.txt-syntax"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
