Ikuyadeu.r-lsp
Keno.uikit-3-snippets
Zignd.html-css-class-completion
axosoft.gitkraken-glo
bibhasdn.django-html
CoenraadS.bracket-pair-colorizer
donjayamanne.jupyter
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
dustinsanders.an-old-hope-theme-vscode
ecmel.vscode-html-css
emmanuelbeziat.vscode-great-icons
Equinusocio.vsc-material-theme
esbenp.prettier-vscode
formulahendry.auto-close-tag
GrapeCity.gc-excelviewer
hangxingliu.vscode-awk-hint
HookyQR.minify
hoovercj.vscode-power-mode
Ikuyadeu.r
James-Yu.latex-workshop
jithurjacob.nbpreviewer
luggage66.AWK
mrmlnc.vscode-scss
ms-python.python
PeterJausovec.vscode-docker
shakram02.bash-beautify
streetsidesoftware.code-spell-checker
